Repository: VFedyk/lnt
Catalog: lib/l10n/app_*.arb
Languages: uk

source: Home
uk: Головна

source: Texts
uk: Тексти

source: Vocabulary
uk: Словник

source: Stats
uk: Статистика

source: Languages
uk: Мови

source: Settings
uk: Налаштування

source: Cancel
uk: Скасувати

source: Save
uk: Зберегти

source: Delete
uk: Видалити

source: Edit
uk: Редагувати

source: Add
uk: Додати

source: Retry
uk: Повторити

source: Create
uk: Створити

source: Import
uk: Імпорт

source: Export
uk: Експорт

source: Close
uk: Закрити

source: Yes
uk: Так

source: No
uk: Ні

source: Search
uk: Пошук

source: Loading...
uk: Завантаження...

source: Error
uk: Помилка

source: Success
uk: Успіх

source: Warning
uk: Попередження

source: Confirm
uk: Підтвердити

source: App Language
uk: Мова застосунку

source: English
uk: Англійська

source: Ukrainian
uk: Українська

source: DeepL Translation
uk: Переклад DeepL

source: DeepL API Key
uk: API ключ DeepL

# deepLApiKeyHint
source: Get your API key from deepl.com/pro-api
uk: Отримайте API ключ на deepl.com/pro-api

source: API Type
uk: Тип API

source: Free
uk: Безкоштовний

# freeApiLimit
source: Free API: 500,000 characters/month
uk: Безкоштовний API: 500 000 символів/місяць

# proApiPayPerUse
source: Pro API: Pay per usage
uk: Pro API: Оплата за використання

source: Target Language
uk: Цільова мова

source: Language for translations
uk: Мова для перекладів

source: Save Settings
uk: Зберегти налаштування

source: Settings saved
uk: Налаштування збережено

source: Monthly Usage
uk: Місячне використання

# couldNotLoadUsage
source: Could not load usage. Check your API key.
uk: Не вдалося завантажити. Перевірте API ключ.

source: Loading usage...
uk: Завантаження використання...

# charactersRemaining
source: {count} characters remaining
uk: {count} символів залишилось

# charactersUsed
source: {used} / {limit} characters
uk: {used} / {limit} символів

source: No Languages Yet
uk: Мов ще немає

# addLanguageToStart
source: Add a language to get started
uk: Додайте мову, щоб почати

source: Add Language
uk: Додати мову

source: Edit Language
uk: Редагувати мову

# deleteLanguageQuestion
source: Delete Language?
uk: Видалити мову?

# deleteLanguageConfirm
source: This will delete "{name}" and all associated texts, terms, and dictionaries. Continue?
uk: Це видалить "{name}" та всі пов'язані тексти, терміни та словники. Продовжити?

source: Total Terms
uk: Всього термінів

source: Known
uk: Відомі

source: Unknown
uk: Невідомі

# unknownWords
source: {count} unknown words
uk: {count} невідомих слів

# unknownCharacters
source: {count} unknown characters
uk: {count} невідомих символів

source: Completed!
uk: Завершено!

source: Quick Actions
uk: Швидкі дії

source: Add Text
uk: Додати текст

source: Import Vocabulary
uk: Імпортувати словник

source: Recently read
uk: Нещодавно прочитане

source: Recently added
uk: Нещодавно додане

source: No texts read yet.
uk: Ще не прочитано жодного тексту.

# noTextsYetAddOne
source: No texts yet. Add one to get started!
uk: Текстів ще немає. Додайте один, щоб почати!

source: Search texts...
uk: Пошук текстів...

source: Search terms...
uk: Пошук термінів...

source: No collections or texts
uk: Немає колекцій чи текстів

source: All texts completed!
uk: Всі тексти завершено!

source: Show completed texts
uk: Показати завершені тексти

source: Hide completed texts
uk: Сховати завершені тексти

# completedHidden
source: {count} completed hidden
uk: {count} завершених сховано

source: Import from URL
uk: Імпорт з URL

source: Import TXT
uk: Імпорт TXT

source: Import EPUB
uk: Імпорт EPUB

source: Importing EPUB...
uk: Імпорт EPUB...

source: Import Complete
uk: Імпорт завершено

# couldNotImportEpub
source: Could not import EPUB: {error}
uk: Не вдалося імпортувати EPUB: {error}

source: New Collection
uk: Нова колекція

source: Edit Collection
uk: Редагувати колекцію

source: Delete Collection?
uk: Видалити колекцію?

# deleteCollectionConfirm
source: Delete "{name}" and its {count} text(s)?
uk: Видалити "{name}" та {count} текст(ів)?

# deleteCollectionSimple
source: Delete "{name}"?
uk: Видалити "{name}"?

source: Delete Text?
uk: Видалити текст?

# deleteTextConfirm
source: Delete "{title}"?
uk: Видалити "{title}"?

source: Edit Text
uk: Редагувати текст

source: Title
uk: Назва

source: Text Content
uk: Вміст тексту

source: Set Cover
uk: Встановити обкладинку

source: Add Cover
uk: Додати обкладинку

source: Remove Cover
uk: Видалити обкладинку

source: No terms found
uk: Термінів не знайдено

source: Import CSV
uk: Імпорт CSV

source: Export CSV
uk: Експорт CSV

source: Export Anki
uk: Експорт Anki

source: Name
uk: Назва

source: Description
uk: Опис

source: Description (optional)
uk: Опис (необов'язково)

source: Required
uk: Обов'язково

# sortByName
source: Name
uk: За назвою

# sortByDateAdded
source: Date Added
uk: За датою додавання

# sortByLastRead
source: Last Read
uk: За останнім читанням

source: List view
uk: Список

source: Grid view
uk: Сітка

source: Switch to list view
uk: Перейти до списку

source: Switch to grid view
uk: Перейти до сітки

source: Fetch content
uk: Завантажити вміст

source: Preview
uk: Попередній перегляд

# wordsCount
source: {count} words
uk: {count} слів

# charactersCount
source: {count} characters
uk: {count} символів

# pleaseEnterUrl
source: Please enter a URL
uk: Введіть URL

# pleaseEnterTitle
source: Please enter a title
uk: Введіть назву

source: Book
uk: Книга

source: Author
uk: Автор

source: Chapters
uk: Розділи

source: Total parts
uk: Всього частин

source: Characters
uk: Символів

source: Notes
uk: Примітки

# textsTitle
source: Texts - {languageName}
uk: Тексти - {languageName}

source: Sort
uk: Сортувати

# textCount
source: {count, plural, =1{1 text} other{{count} texts}}
uk: {count, plural, =1{1 текст} few{{count} тексти} other{{count} текстів}}

# unknownCount
source: {count} unknown
uk: {count} невідомих

# vocabularyTitle
source: Vocabulary - {languageName}
uk: Словник - {languageName}

# exportedTerms
source: Exported {count} terms
uk: Експортовано {count} термінів

# exportFailed
source: Export failed: {error}
uk: Помилка експорту: {error}

# importedTerms
source: Imported {count} terms
uk: Імпортовано {count} термінів

# importFailed
source: Import failed: {error}
uk: Помилка імпорту: {error}

source: All
uk: Всі

# statusIgnored
source: Ignored
uk: Ігноровані

# statusUnknown
source: Unknown
uk: Невідомі

# statusLearning2
source: Learning 2
uk: Вивчення 2

# statusLearning3
source: Learning 3
uk: Вивчення 3

# statusLearning4
source: Learning 4
uk: Вивчення 4

# statusKnown
source: Known
uk: Відомі

# statusWellKnown
source: Well Known
uk: Добре відомі

# addDictionariesQuestion
source: Add Dictionaries?
uk: Додати словники?

# addDictionariesPrompt
source: Would you like to add dictionaries for {name}?
uk: Бажаєте додати словники для {name}?

source: Later
uk: Пізніше

source: Add Now
uk: Додати зараз

# dictionaryCount
source: {count, plural, =1{1 dictionary} other{{count} dictionaries}}
uk: {count, plural, =1{1 словник} few{{count} словники} other{{count} словників}}

source: Manage Dictionaries
uk: Керувати словниками

# languageNameLabel
source: Language Name
uk: Назва мови

# languageNameHint
source: e.g., Spanish, Japanese, Chinese
uk: напр., Іспанська, Японська, Китайська

source: Right-to-Left Text
uk: Текст справа наліво

# rightToLeftHint
source: For languages like Arabic, Hebrew
uk: Для мов як Арабська, Іврит

source: Show Romanization
uk: Показувати романізацію

# showRomanizationHint
source: Display pronunciation guide
uk: Відображати вимову

source: Split by Character
uk: Розділяти за символами

# splitByCharacterHint
source: For Chinese, Japanese (no spaces)
uk: Для Китайської, Японської (без пробілів)

# addDictionariesAfterCreating
source: Add dictionaries after creating the language
uk: Додайте словники після створення мови

# errorLoadingTerms
source: Error loading terms: {error}
uk: Помилка завантаження термінів: {error}

# errorLoadingLanguages
source: Error loading languages: {error}
uk: Помилка завантаження мов: {error}

source: No dictionaries configured
uk: Словники не налаштовані

source: Lookup "{word}"
uk: Шукати "{word}"

source: Cancel Selection
uk: Скасувати вибір

source: Save as Term
uk: Зберегти як термін

source: Lookup in Dictionary
uk: Шукати у словнику

source: Toggle Legend
uk: Легенда

source: Word List
uk: Список слів

source: Font Size
uk: Розмір шрифту

source: Mark All Known
uk: Позначити все відомим

source: Marked as Finished
uk: Позначено як завершене

source: Mark as Finished
uk: Позначити як завершене

# wordsSelected
source: {count} word(s) selected. Tap + to save as term or tap search to lookup.
uk: Вибрано {count} слів. Натисніть + для збереження або пошук для перегляду.

source: Preview Text
uk: Попередній перегляд

source: Done
uk: Готово

# markAllKnownQuestion
source: Mark All Known?
uk: Позначити все відомим?

# markAllKnownConfirm
source: This will mark all words in this text as "Well Known". Continue?
uk: Це позначить усі слова в цьому тексті як "Добре відомі". Продовжити?

source: Mark All
uk: Позначити все

# allWordsMarkedKnown
source: All words marked as known
uk: Усі слова позначено як відомі

# textMarkedFinished
source: Text marked as finished
uk: Текст позначено як завершений

# textMarkedInProgress
source: Text marked as in progress
uk: Текст позначено як незавершений

source: Continue Reading?
uk: Продовжити читання?

# continueReadingPrompt
source: Would you like to continue with the next text? "{title}"
uk: Бажаєте продовжити з наступним текстом? "{title}"

source: Terms by Status
uk: Терміни за статусом

source: Progress Overview
uk: Огляд прогресу

source: {percent}% Known
uk: {percent}% відомо

source: No terms yet
uk: Ще немає термінів

source: Learning
uk: Вивчення

# dictionariesTitle
source: Dictionaries - {languageName}
uk: Словники - {languageName}

source: Delete Dictionary?
uk: Видалити словник?

# deleteDictionaryConfirm
source: Delete "{name}"?
uk: Видалити "{name}"?

source: Deactivate
uk: Деактивувати

source: Activate
uk: Активувати

source: No dictionaries yet
uk: Словників ще немає

# addDictionariesFor
source: Add dictionaries for {name}
uk: Додайте словники для {name}

source: Add Dictionary
uk: Додати словник

source: Edit Dictionary
uk: Редагувати словник

source: Help
uk: Допомога

source: Dictionary Help
uk: Довідка словників

source: How to use:
uk: Як використовувати:

# dictionaryHelpStep1
source: 1. Add dictionary URLs for this language
uk: 1. Додайте URL словників для цієї мови

# dictionaryHelpStep2
source: 2. Use ### as placeholder for the word
uk: 2. Використовуйте ### як заповнювач для слова

# dictionaryHelpStep3
source: 3. Drag to reorder dictionaries
uk: 3. Перетягуйте для зміни порядку

# dictionaryHelpStep4
source: 4. Toggle active/inactive
uk: 4. Перемикайте активний/неактивний

source: Example URLs:
uk: Приклади URL:

source: Got it
uk: Зрозуміло

source: Dictionary Name
uk: Назва словника

# dictionaryNameHint
source: e.g., WordReference, Jisho
uk: напр., WordReference, Jisho

source: URL Template
uk: Шаблон URL

# urlTemplateHelper
source: Use ### as placeholder for the word
uk: Використовуйте ### як заповнювач для слова

# urlMustContainPlaceholder
source: URL must contain ###
uk: URL повинен містити ###

source: Active
uk: Активний

source: Show in dictionary lookup menu
uk: Показувати в меню пошуку

source: Quick Templates:
uk: Швидкі шаблони:

source: Dictionary Lookup
uk: Пошук у словнику

source: Reload
uk: Оновити

source: Back
uk: Назад

source: Forward
uk: Вперед

source: Open in Browser
uk: Відкрити в браузері

# errorLoadingPage
source: Error loading page: {error}
uk: Помилка завантаження сторінки: {error}

# errorOpeningBrowser
source: Error opening browser: {error}
uk: Помилка відкриття браузера: {error}

source: Term
uk: Термін

# useOriginal
source: Use original: {text}
uk: Використати оригінал: {text}

# original
source: Original: {text}
uk: Оригінал: {text}

source: Base:
uk: Базова форма:

source: Remove link
uk: Видалити зв'язок

source: Link to base form...
uk: Зв'язати з базовою формою...

# forms
source: Forms: {forms}
uk: Форми: {forms}

source: Status
uk: Статус

source: Language:
uk: Мова:

source: Translation
uk: Переклад

source: Translate with DeepL
uk: Перекласти з DeepL

source: Romanization / Pronunciation
uk: Романізація / Вимова

source: Example Sentence
uk: Приклад речення

# translationFailed
source: Translation failed. Check your API key.
uk: Помилка перекладу. Перевірте API ключ та налаштування.

# languageNotSupported
source: Language "{name}" not supported by DeepL
uk: Мова "{name}" не підтримується

source: (no DeepL)
uk: (без DeepL)

source: Select Base Form
uk: Обрати базову форму

source: No existing terms found
uk: Існуючих термінів не знайдено

source: Create new base term
uk: Створити новий базовий термін

source: Translation (optional)
uk: Переклад (необов'язково)

source: Create "{term}"
uk: Створити "{term}"

# statusLegendTitle
source: Status Legend
uk: Легенда статусів

# databaseSection
source: Database
uk: База даних

source: Database path
uk: Шлях до бази даних

# openDatabaseDirectory
source: Open Directory
uk: Відкрити директорію

source: Change Database
uk: Змінити базу даних

source: Restart Required
uk: Потрібен перезапуск

# databaseChangedMessage
source: The database has been changed. The application will now close. Please reopen it to use the new database.
uk: Базу даних змінено. Програма зараз закриється. Будь ласка, відкрийте її знову для використання нової бази даних.

# posNoun
source: Noun
uk: Іменник

# posVerb
source: Verb
uk: Дієслово

# posAdjective
source: Adjective
uk: Прикметник

# posAdverb
source: Adverb
uk: Прислівник

# posPronoun
source: Pronoun
uk: Займенник

# posPreposition
source: Preposition
uk: Прийменник

# posConjunction
source: Conjunction
uk: Сполучник

# posInterjection
source: Interjection
uk: Вигук

# posArticle
source: Article
uk: Артикль

# posNumeral
source: Numeral
uk: Числівник

# posParticle
source: Particle
uk: Частка

# posOther
source: Other
uk: Інше

source: Part of speech
uk: Частина мови

source: Base form
uk: Базова форма

source: Meaning
uk: Значення

source: Add translation
uk: Додати переклад

source: Translations
uk: Переклади
